# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

import room_1

room1=room_1.room_1()
print("В комнате room1 живут:", ", ".join(room1))
